; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj3 obj5 obj8 obj10 - airport
	obj1 obj6 - city
	obj2 obj7 obj9 obj11 obj14 obj15 obj16 - package
	obj4 - airplane
	obj12 obj13 - truck
)

(:init
	(in-city obj8 obj6)
	(at obj4 obj3)
	(at obj2 obj0)
	(at obj12 obj3)
	(at obj11 obj10)
	(in-city obj10 obj6)
	(in-city obj3 obj1)
	(at obj14 obj8)
	(at obj9 obj8)
	(at obj7 obj5)
	(at obj15 obj3)
	(at obj13 obj8)
	(at obj16 obj8)
	(in-city obj5 obj6)
	(in-city obj0 obj1)
)

(:goal (and
	(at obj15 obj0)
	(at obj2 obj8)
	(at obj11 obj0)
	(at obj9 obj3)
	(at obj7 obj0)
	(at obj14 obj5)
	(at obj16 obj10)
))
)

; plan
1. (fly obj4 obj3 obj8)
   deleted: (at obj4 obj3)
   added: (at obj4 obj8)
   goals met: 0 of 7
2. (load obj4 obj9 obj8)
   deleted: (at obj9 obj8)
   added: (in obj9 obj4)
   goals met: 0 of 7
3. (load obj4 obj16 obj8)
   deleted: (at obj16 obj8)
   added: (in obj16 obj4)
   goals met: 0 of 7
4. (load obj4 obj14 obj8)
   deleted: (at obj14 obj8)
   added: (in obj14 obj4)
   goals met: 0 of 7
5. (fly obj4 obj8 obj3)
   deleted: (at obj4 obj8)
   added: (at obj4 obj3)
   goals met: 0 of 7
6. (unload obj4 obj9 obj3)
   deleted: (in obj9 obj4)
   added: (at obj9 obj3)
   goals met: 1 of 7
7. (fly obj4 obj3 obj0)
   deleted: (at obj4 obj3)
   added: (at obj4 obj0)
   goals met: 1 of 7
8. (load obj4 obj2 obj0)
   deleted: (at obj2 obj0)
   added: (in obj2 obj4)
   goals met: 1 of 7
9. (load obj12 obj15 obj3)
   deleted: (at obj15 obj3)
   added: (in obj15 obj12)
   goals met: 1 of 7
10. (drive obj12 obj3 obj0)
   deleted: (at obj12 obj3)
   added: (at obj12 obj0)
   goals met: 1 of 7
11. (fly obj4 obj0 obj10)
   deleted: (at obj4 obj0)
   added: (at obj4 obj10)
   goals met: 1 of 7
12. (unload obj4 obj16 obj10)
   deleted: (in obj16 obj4)
   added: (at obj16 obj10)
   goals met: 2 of 7
13. (fly obj4 obj10 obj5)
   deleted: (at obj4 obj10)
   added: (at obj4 obj5)
   goals met: 2 of 7
14. (load obj4 obj7 obj5)
   deleted: (at obj7 obj5)
   added: (in obj7 obj4)
   goals met: 2 of 7
15. (unload obj4 obj14 obj5)
   deleted: (in obj14 obj4)
   added: (at obj14 obj5)
   goals met: 3 of 7
16. (fly obj4 obj5 obj0)
   deleted: (at obj4 obj5)
   added: (at obj4 obj0)
   goals met: 3 of 7
17. (unload obj4 obj7 obj0)
   deleted: (in obj7 obj4)
   added: (at obj7 obj0)
   goals met: 4 of 7
18. (unload obj12 obj15 obj0)
   deleted: (in obj15 obj12)
   added: (at obj15 obj0)
   goals met: 5 of 7
19. (fly obj4 obj0 obj10)
   deleted: (at obj4 obj0)
   added: (at obj4 obj10)
   goals met: 5 of 7
20. (load obj4 obj11 obj10)
   deleted: (at obj11 obj10)
   added: (in obj11 obj4)
   goals met: 5 of 7
21. (fly obj4 obj10 obj0)
   deleted: (at obj4 obj10)
   added: (at obj4 obj0)
   goals met: 5 of 7
22. (unload obj4 obj11 obj0)
   deleted: (in obj11 obj4)
   added: (at obj11 obj0)
   goals met: 6 of 7
23. (fly obj4 obj0 obj8)
   deleted: (at obj4 obj0)
   added: (at obj4 obj8)
   goals met: 6 of 7
24. (unload obj4 obj2 obj8)
   deleted: (in obj2 obj4)
   added: (at obj2 obj8)
   goals met: 7 of 7
